
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.redis_access_key
* Replace
  * module.probate-caveats-fe-redis-cache.azurerm_private_endpoint.this[0]
  * module.probate-caveats-fe-redis-cache.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://probate-aat.vault.azure.net/secrets/caveats-fe-redis-access-key/cb1a4c350da946c7a55d0a3e2ba04e56"
        name                    = "caveats-fe-redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.probate-caveats-fe-redis-cache.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/probate-caveats-fe-redis-cache-aat" -> (known after apply)
        name                     = "probate-caveats-fe-redis-cache-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Network/networkInterfaces/probate-caveats-fe-redis-cache-aat.nic.754f7a50-1cdc-4935-9b65-ba2fc3a4ba7c"
              - name = "probate-caveats-fe-redis-cache-aat.nic.754f7a50-1cdc-4935-9b65-ba2fc3a4ba7c"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/probate-caveats-fe-redis-cache-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "probate-caveats-fe-redis-cache-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.14",
                        ]
                      - name         = "probate-caveats-fe-redis-cache-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "application"         = "probate"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/probate-caveats-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#probate"
            "environment"         = "staging"
            "managedBy"           = "Probate"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/probate-caveats-fe-redis-cache-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "probate-caveats-fe-redis-cache-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Cache/redis/probate-caveats-fe-redis-cache-aat" -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.14" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.probate-caveats-fe-redis-cache.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "probate-caveats-fe-redis-cache-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/probate-caveats-fe-redis-cache-cache-aat/providers/Microsoft.Cache/redis/probate-caveats-fe-redis-cache-aat" -> (known after apply)
        name                          = "probate-caveats-fe-redis-cache-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "probate"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/probate-caveats-frontend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#probate"
            "environment"         = "staging"
            "managedBy"           = "Probate"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":647,"Program":"tfcmt","SHA1":"","Vars":{}} -->